## Plan Result (prod-app-registrations)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;DTS FinOps Enterprise Reporting&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS FinOps Enterprise Reporting-repo:hmcts/finops-reporting-incremental-export:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS FinOps Enterprise Reporting-repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;DTS FinOps Enterprise Reporting&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg&#34;]
* Delete
  * module.this.azuread_application.this[&#34;DTS FinOps Enterprise Rporting&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;DTS FinOps Enterprise Rporting&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Rporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["DTS FinOps Enterprise Reporting"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS FinOps Enterprise Reporting"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application.this["DTS FinOps Enterprise Rporting"] will be destroyed
  # (because key ["DTS FinOps Enterprise Rporting"] is not in for_each map)
  - resource "azuread_application" "this" {
      - app_role_ids                   = {} -> null
      - application_id                 = "03563ec0-cb77-4635-ae52-3cc0715fbfc0" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "DTS FinOps Enterprise Rporting" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3" -> null
      - owners                         = [
          - "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "HMCTS.NET" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - required_resource_access {
          - resource_app_id = "797f4846-ba00-4fd7-ba43-dac1f8f63013" -> null

          - resource_access {
              - id   = "41094075-9dad-400e-a0bd-54e686782033" -> null
              - type = "Scope" -> null
            }
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS FinOps Enterprise Reporting-repo:hmcts/finops-reporting-incremental-export:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__finops-reporting-incremental-export_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/finops-reporting-incremental-export:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS FinOps Enterprise Reporting-repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__finops-reporting-incremental-export_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:pull_request"] will be destroyed
  # (because key ["DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:pull_request"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "this" {
      - application_object_id = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "ae284147-fd1a-45ae-bd11-65e3e42a0a51" -> null
      - display_name          = "repo_hmcts__finops-reporting-incremental-export_pull_request" -> null
      - id                    = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3/federatedIdentityCredential/ae284147-fd1a-45ae-bd11-65e3e42a0a51" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:hmcts/finops-reporting-incremental-export:pull_request" -> null
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master"] will be destroyed
  # (because key ["DTS FinOps Enterprise Rporting-repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "this" {
      - application_object_id = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "ed95847f-4477-4a36-9be2-38a11560fd14" -> null
      - display_name          = "repo_hmcts__finops-reporting-incremental-export_ref_refs__heads__master" -> null
      - id                    = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3/federatedIdentityCredential/ed95847f-4477-4a36-9be2-38a11560fd14" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:hmcts/finops-reporting-incremental-export:ref:refs/heads/master" -> null
    }

  # module.this.azuread_service_principal.this["DTS FinOps Enterprise Reporting"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.this.azuread_service_principal.this["DTS FinOps Enterprise Rporting"] will be destroyed
  # (because key ["DTS FinOps Enterprise Rporting"] is not in for_each map)
  - resource "azuread_service_principal" "this" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "03563ec0-cb77-4635-ae52-3cc0715fbfc0" -> null
      - application_tenant_id        = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - display_name                 = "DTS FinOps Enterprise Rporting" -> null
      - id                           = "94d1b62a-0d4f-487a-bfa9-fe848508266e" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "94d1b62a-0d4f-487a-bfa9-fe848508266e" -> null
      - owners                       = [
          - "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Rporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] will be destroyed
  # (because key ["DTS FinOps Enterprise Rporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleAssignments/e6eacef7-0191-06ef-576a-5547d688a5da" -> null
      - name                 = "e6eacef7-0191-06ef-576a-5547d688a5da" -> null
      - principal_id         = "94d1b62a-0d4f-487a-bfa9-fe848508266e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name = "Contributor" -> null
      - scope                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab" -> null
    }

Plan: 6 to add, 0 to change, 5 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["DTS FinOps Enterprise Rporting"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "fa4fed83-bf7e-4af1-8b13-9c1d5c369fa3"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

      + required_resource_access {
          + resource_app_id = "797f4846-ba00-4fd7-ba43-dac1f8f63013"

          + resource_access {
              + id   = "41094075-9dad-400e-a0bd-54e686782033"
              + type = "Scope"
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS FinOps Enterprise Rporting"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "94d1b62a-0d4f-487a-bfa9-fe848508266e"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":37,"Program":"tfcmt","SHA1":"","Target":"prod-app-registrations","Vars":{}} -->